Repository: 84000/data-translation-memory
Catalog: toh276_84000-not-forsaking-the-buddha.tmx
Source language: bo
Languages: en

source: འཕགས་པ་སངས་རྒྱས་མི་སྤང་བ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Great Vehicle Sūtra Not Forsaking the Buddha Not Forsaking the Buddha

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was on Vulture Peak Mountain in Rājagṛha, together with a great saṅgha of 1,250 monks and eighty thousand bodhisattvas.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་མེད་ཀྱིས་བྱིན་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མྱ་ངན་གྱི་མུན་པ་ཐམས་ཅད་ངེས་པར་འཇོམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་ཀྱི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚངས་པ་ལས་བྱུང་བ་འབྲུག་དབྱངས་སྤྲིན་གྱི་ང་རོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་པོ་ཆེའི་མེ་ཏོག་ཀུན་དུ་རྒྱས་པའི་གཟི་བརྗིད་ལྟ་བུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེང་གེའི་ཡོན་ཏན་ལས་བྱུང་བ་འབྲུག་གི་ང་རོས་འགྲོ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་ཀྱི་གཟི་བརྗིད་རྣམ་པར་བསྒྲགས་པ་གྲགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་ཀྱི་བཀོད་པ་མཐའ་ཡས་པ་བསྒྲུབ་པ་ལ་སེམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་རིན་པོ་ཆེ་མཐའ་ཡས་པའི་མེ་ཏོག་ཀུན་དུ་རྒྱས་པའི་རྣམ་པར་བསྒྲགས་པ་གྲགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་སྣང་བས་སྟོབས་པ་བསྟན་པའི་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཅུ་པོ་དེ་དག་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འཁོད་དོ།
en: At that time, the bodhisattva great being Aśokadatta was present in the assembly, as were the bodhisattva great being Vanquisher of the Darkness of Sorrow, the bodhisattva great being Light of Wisdom, the bodhisattva great being Roaring Thunder Cloud from Brahmā, the bodhisattva great being Glorious Blooming Flower of Precious Qualities, the bodhisattva great being Born from the Lion’s Virtues and Moving with a Thunder Roar, the bodhisattva great being Renowned Brilliant Light, the bodhisattva great being Aiming for Accomplishment of Limitless Wisdom Array, the bodhisattva great being Renowned Blooming Flower of Limitless Precious Qualities, and the bodhisattva great being Intelligent Light of Insight Displaying Power.

source: །དེ་དག་ནི་གཟུངས་ཐོབ་པར་བྱ་བའི་ཕྱིར་ལོ་བདུན་དུ་བརྩོན་པར་གྱུར་པ་དག་གོ།
en: These ten bodhisattva great beings who were present in the assembly had exerted themselves for seven years with the aim of attaining dhāraṇī.

source: །དེ་དག་ནི་ལོ་བདུན་འདས་ནས་སེམས་མཉམ་པར་བཞག་པ་ཡང་མ་ཐོབ་ན་གང་གཟུངས་ཐོབ་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས།
en: However, although seven years had passed, they had not even attained mental equipoise, let alone dhāraṇī.

source: དེ་དག་ནི་ལོ་བདུན་དུ་རྨུགས་པ་དང་གཉིད་ཡོངས་སུ་སྤངས་ཤིང་འདུག་པ་དང་། འཆག་པ་ལ་བརྩོན་པར་བྱས།
en: For seven years, they had avoided dullness and sleep and exerted themselves while sitting and walking.

source: འདོད་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་ལ་བརྩོན་པར་བྱས་ཀྱང་བསམ་པ་བཞིན་མ་ཐོབ་ཅིང་གཟུངས་མ་ཐོབ་ནས་ཡོངས་སུ་སྐྱོ་བའི་ཡིད་ཀྱིས་བསླབ་པ་ཕུལ་ནས་ཉམས་པར་གྱུར་ལ།
en: They had exerted themselves in relinquishing all thoughts of desire. Nevertheless, they had not achieved their goal and had not attained dhāraṇī; and thus, feeling discouraged, they had offered back their precepts and lapsed.

source: ཐམས་ཅད་ཀྱང་ཁྱིམ་ན་གནས་པའི་སྐྱོན་ཁས་བླངས་ཤིང་བསྟན་པ་འདི་ལས་ཕྱིར་དོང་བ་ཤ་སྟག་གོ།
en: All of them, having thus assented to the shortcomings of householder life, had simply turned their backs on the teaching.

source: །ཡང་དེའི་ཚེ་རྒྱལ་པོ་མ་སྐྱེས་དགྲ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ།
en: At that time, King Ajātaśatru was also present in the assembly.

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་མ་སྐྱེས་དགྲའི་འགྱོད་པ་བསལ་ཏོ།
en: The Blessed One had already dispelled the king’s regrets.

source: །འགྱོད་པ་བསལ་བ་དེས་ཀྱང་ཞག་བདུན་དུ་སྦྱིན་པ་བྱིན་ཞིང་བཅིངས་པ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཐར་བར་བྱས་སོ།
en: With his regrets dispelled, for seven days the king had engaged in generosity and pardoned all prisoners.

source: །དེ་སྦྱིན་པ་བྱིན་ཏེ་ཞག་བདུན་པོ་དེ་དག་འདས་ནས་སྲོག་ཆགས་བྱེ་བ་ཕྲག་བདུན་དང་ལྷན་ཅིག་ཏུ་ཆོས་མཉན་པའི་ཕྱིར་བཅོམ་ལྡན་འདས་ཀྱི་ཐད་དུ་ལྷགས་སོ།
en: After having engaged in generosity for seven days, the king had returned to the Blessed One, together with seventy million other beings, to listen to the Dharma.

source: །རིགས་ཀྱི་བུ་བཅུ་པོ་ཁྱིམ་ན་གནས་པའི་སྐྱོན་ཁས་བླངས་ནས་བསྟན་པ་འདི་ལས་ཕྱིར་དོང་བ་དེ་དག་ཀྱང་འཁོར་དེ་ཉིད་དུ་ལྷགས་སོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པ་ཞེས་བྱ་བ་གཟུངས་ཐོབ་པ།
en: The ten noble sons who had assented to the shortcomings of householder life and turned their backs on the teaching had also come to the assembly. At this point, the bodhisattva great being Undaunted also joined the assembly. He had attained dhāraṇī.

source: བསྐལ་པ་གྲངས་མེད་པར་རྗེས་སུ་འཐུན་པའི་ཆོས་ཀྱི་བཟོད་པ་དང་ལྡན་པ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པ།
en: For countless eons he had possessed the acceptance of phenomena that is consistent with reality and had attained the acceptance that phenomena are nonarising.

source: སྤོབས་པ་སྣ་ཚོགས་པ།
en: He was endowed with various forms of eloquence.

source: ཡེ་ཤེས་ཀྱི་སྒོ་དང་། ཆོས་ཀྱི་སྒོ་ཐམས་ཅད་སྒྲུབ་པ་ལ་མཁས་པ། ཆོས་བཤད་པའི་ཕྱིར་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་དང་། ལྷག་པའི་བསམ་པ་དང་། མོས་པ་ལ་མཁས་པ་ཞིག་ཀྱང་འཁོར་དེ་ཉིད་དུ་འོངས་སོ།
en: He was expert in accomplishing all gateways to wisdom and the Dharma, and, in order to explain the Dharma, he was skilled concerning beings’ mindsets, intentions, and interests.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པ་སྟན་ལས་ལངས་ཏེ། ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: The bodhisattva great being Undaunted rose from his seat, draped his shawl over one shoulder, knelt on his right knee, and bowed with joined palms toward the Blessed One.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ནི་དགུང་ལོ་བདུན་དུ་གཟུངས་ཀྱི་དོན་ལ་བརྩོན་པར་གྱུར་ན་དེ་དག་བསམ་པ་མ་གྲུབ་ཅིང་བསྟན་པ་འདི་ལས་སླར་མཆིས་པ་ཁྱིམ་ན་གནས་པར་གཡར་གྱིས་བླངས་པ་ལགས་ན།
en: He then said to the Blessed One, “Blessed One, these ten noble sons exerted themselves for seven years with the aim of attaining dhāraṇī, yet they did not accomplish their goal, and so they have left the teaching and profess to having taken up the householder life.

source: དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་རིགས་ཀྱི་བུ་དེ་དག་ལ་ཅི་ནས་མྱུར་བ་ཁོ་ནར་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་ལེགས་པར་ལུང་དབོག་པར་མཛད་དུ་གསོལ།
en: This being so, Blessed One, I beseech you to please bestow upon these noble sons an instruction that will enable them to swiftly attain wisdom.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རིགས་ཀྱི་བུ་འདི་ལྟར་དེ་དག་གིས་སངས་རྒྱས་མི་སྤང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་མ་ཐོས་ལ། སངས་རྒྱས་སྤོང་བ་ནི་རྗེས་སུ་ཐོབ་སྟེ།
en: The Blessed One replied to the bodhisattva great being Undaunted, “Noble son, these individuals have not heard the Dharma discourse called Not Forsaking the Buddha , and so they have ended up forsaking the Buddha.

source: དེས་ན་རིགས་ཀྱི་བུ་དེ་དག་མྱུར་དུ་ཤེས་པ་འདི་ལ་མ་སྐྱེས་སོ།
en: That is why these noble sons have failed to swiftly develop in their understanding.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་ཞུས་སོ།
en: The bodhisattva great being Undaunted then addressed the following verses to the Blessed One:

source: །ཆོས་ཀྱི་རྒྱལ་པོ་འོད་མཛད་པ།
en: “Illuminating Dharma King,

source: །མི་ཡི་ཉི་མ་ཁྱོད་ལ་ཞུ།
en: Sun of humans, I request you to teach

source: །བྱང་ཆུབ་སེམས་དཔའི་ལས་སྤྱོད་པ།
en: The conduct that bodhisattvas engage in

source: །སྤྱོད་པ་གང་ལགས་དེ་བསྟན་གསོལ།
en: Please explain that conduct.

source: །དཔག་མེད་ཁྱབ་པར་འཕགས་པའི་བློ་གྲགས་པ།
en: “Your intelligence is immeasurable and exalted;

source: །སངས་རྒྱས་ཐོགས་མེད་སྟོབས་བཅུ་མཚུངས་མ་མཆིས།
en: Unimpeded Buddha, your ten powers are unmatched.

source: །སྲིད་གསུམ་འབྱུང་བ་རྣམ་གྲོལ་སྤྲོས་མི་མངའ།
en: You are free from the three realms of existence and beyond conceptual constructs—

source: །སངས་རྒྱས་བྱང་ཆུབ་སྤྱོད་པ་དྲི་མེད་གསུངས།
en: Buddha, you have taught the stainless conduct of bodhisattvas.

source: །དཔག་མེད་ཡེ་ཤེས་མངའ་བ་ཁྱོད་ལ་ཞུ།
en: “Master of immeasurable wisdom, I ask you.

source: །ཡིད་གཉིས་གཅོད་པར་མཛད་པ་ཁྱོད་ལ་ཞུ།
en: Dispeller of doubts, I ask you.

source: །བཅོམ་ལྡན་མཚུངས་པ་མི་མངའ་ཁྱོད་ལ་ཞུ།
en: Matchless Blessed One, I ask you.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཚུལ་གང་ལགས།
en: What is the proper conduct of bodhisattvas?

source: །རྒྱལ་བ་བདུད་ཐུལ་བདེ་གཤེགས་གང་གིས་ན།
en: “Victor, tamer of demons, Well-Gone One,

source: །ཉོན་མོངས་ཀུན་ལས་རྣམ་པར་གྲོལ་བར་འགྱུར།
en: You liberate beings from all the afflictions.

source: །ཐུགས་རྗེས་ཉོན་མོངས་ཐུལ་ལ་བྱང་ཆུབ་ལམ།
en: You compassionately tame the afflictions and show the path to awakening;

source: །འཕགས་པ་དེ་ནི་རབ་ཏུ་བཤད་དུ་གསོལ།
en: Please explain that noble teaching.

source: །ལེགས་གསལ་ལེགས་བྱུང་ལེགས་འབྲེལ་གསུང་བ་བོ།
en: “Your teaching is excellent in terms of its clarity, source, and relevance.

source: །སྲིད་སེལ་སྲིད་འགྲོ་རྣམ་འཇོམས་ལྷུར་མཛད་པ།
en: Tirelessly, you eliminate existence and overcome its states.

source: །དགེ་སྦྱོང་བཟང་པོ་སྨྲ་མཆོག་ཡིད་གཉིས་སེལ།
en: Excellent mendicant, your perfect speech dispels all doubts.

source: །རྒྱལ་བ་བདེ་གཤེགས་དྲི་མེད་སྤྱོད་ཀུན་གསུངས།
en: Victorious Well-Gone One, you teach all the modes of stainless conduct.

source: །སྔོན་གྱི་སྲིད་བརྒྱར་ལེགས་སྤྱད་ཡོན་ཏན་དགེ།
en: “Over hundreds of past lives, you accrued virtuous qualities.

source: །འགྲོ་བ་ཕན་བདེར་བསྔོ་ལ་བརྩོན་པ་པོ།
en: You diligently dedicated all for the benefit and happiness of beings.

source: །རིན་ཆེན་གླང་པོ་རྟ་སྤངས་ཡུན་ཀྱང་རིང་།
en: For long you relinquished jewels, elephants, and horses,

source: །བུད་མེད་ཚོགས་དང་བུ་ཡང་སྤངས་མཛད་པ།
en: And the company of women and children as well.

source: །བཟོད་དང་དུལ་དགྱེས་ཚུལ་ཁྲིམས་ཡོན་ཏན་གཞོལ།
en: “Delighting in patience and discipline, you ardently practiced the virtues of discipline.

source: །བློ་གྲོས་དགྱེས་གཞོལ་བརྟུལ་ཞུགས་དཀའ་ཐུབ་བརྩམས།
en: You joyfully pursued intelligence and took on austerities and hardships.

source: །ཡོན་ཏན་ཚོལ་བས་སྡུག་བསྔལ་བརྒྱ་བཟོད་པ།
en: In the pursuit of good qualities, you endured hundreds of sufferings.

source: །རྒྱལ་བ་ཁྱོད་ཀྱིས་དེ་བརྙེས་ཡིད་གཉིས་བྲལ།
en: Victor, there is no doubt that you have attained all this.

source: །སྤྱོད་ལ་མཁས་པ་ཡིད་གཉིས་རྣམ་སྤངས་པ།
en: “You are skilled in conduct and have relinquished all doubts.

source: །སྐྱོན་ཚོགས་དྲི་མ་གསུམ་གྱི་ཐ་བ་བྲལ།
en: You are free of the defects of the three stains and all faults.

source: །འགྲོ་བ་ཐམས་ཅད་དུ་ཡང་རབ་གཤེགས་པ།
en: You have entered all existences.

source: །མགོན་པོ་བྱང་ཆུབ་མཆོག་གི་ཚུལ་བཤད་གསོལ།
en: Protector, please explain the proper conduct of supreme awakening!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One then addressed the bodhisattva great being Undaunted:

source: །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བཅུ་པོ་འདི་དག་ཐམས་ཅད་ཀྱིས་ནི་སངས་རྒྱས་མི་སྤང་བ་བྱས་སོ། །གསོལ་པ།
en: “Noble son, none of these ten bodhisattvas has in fact forsaken the Buddha.”

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་མི་སྤང་བ་ཞེས་བགྱི་བ་དེ་གང་ལགས། བཀའ་སྩལ་པ།
en: The bodhisattva great being then asked, “Blessed One, what do you mean by saying that they have not forsaken the Buddha?”

source: རིགས་ཀྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་སུམ་ཅུ་འདས་པ་དེའི་ཚེ་དེའི་དུས་ན་འཇིག་རྟེན་གྱི་ཁམས་སྨིག་རྒྱུ་ཅན་དུ་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་གཟིགས་པའི་ང་རོ་ཞེས་བྱ་བ་བྱུང་བར་གྱུར་པ་དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཕྱི་མའི་དུས་ཕྱི་མའི་ཚེ་ན་རིགས་ཀྱི་བུ་བཅུ་པོ་འདི་དག་ཁྱིམ་བདག་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུའི་གཞོན་ནུར་གྱུར་ཏོ།
en: The Blessed One replied, “Noble son, in a bygone age, thirty eons ago, in a world called Mirage, a thus-gone one named Roar of Vision appeared. In the period after this thus-gone one had passed into parinirvāṇa, these ten noble sons were born as the sons of householders who were like great śāla trees.

source: །དེའི་ཚེ་རིགས་ཀྱི་བུ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་གཙུག་ལག་ཁང་ལྔ་བརྒྱ་བྱེད་དུ་བཅུག་གོ།
en: At that time, these ten noble sons commissioned the building of five hundred monasteries.

source: །གཙུག་ལག་ཁང་རེ་རེར་ཡང་དགེ་སློང་སྟོང་སྟོང་གནས་པར་གྱུར་ཏོ།
en: In each of those monasteries, a thousand monks resided.

source: །རིགས་ཀྱི་བུ་དེའི་ཚེ་ཆོས་སྨྲ་བ་སྤོབས་པ་བརྩེགས་པ་ཞེས་བྱ་བ་གཟུངས་ཐོབ་པ་ཞིག་ཆོས་སྟོན་ཏོ།
en: Noble son, at that time there was a Dharma teacher named Pratibhānakūṭa who had attained dhāraṇī and was teaching the Dharma.

source: །རིགས་ཀྱི་བུ་ཆོས་སྨྲ་བ་སྤོབས་པ་བརྩེགས་པ་དེ་ཆོས་ཀྱི་སྟན་ལ་འདུག་པ་ལ་སངས་རྒྱས་ལྔ་སྟོང་སྤོབས་པ་སྒྲུབ་པར་མཛད་དེ། ལྷ་དུང་ཕྱུར་ཕྲག་བརྒྱད་ཀྱང་ལུས་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཏོ།
en: “Noble son, the Dharma teacher Pratibhānakūṭa would accomplish the eloquence of five thousand Buddhas while seated on the Dharma seat, as eight hundred million gods applied themselves diligently in worshiping his body.

source: །དེའི་ཆོས་བཤད་པ་གཅིག་གིས་སྲོག་ཆགས་བདུན་ཁྲི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །སྲོག་ཆགས་ཁྲི་ནི་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ་བོ།
en: Through just one of his Dharma discourses, seventy thousand beings would be established in irreversible progress toward unexcelled and perfect awakening, and ten thousand beings would attain the fruition of stream enterer.

source: །རིགས་ཀྱི་བུ་དེའི་ཚེ་རྒྱལ་པོ་ཟླ་བས་བྱིན་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་ངོ་།
en: “Noble son, at that time there was a king named Candradatta.

source: །དེས་ཆོས་ལ་གུས་པས་ཆོས་སྨྲ་བ་དེ་ལ་མཆོད་པའི་ཕྱིར་བུད་མེད་ལྔ་བརྒྱ་དང་གླུ་དབྱངས་དང་རོལ་མོ་བྱས་སོ།
en: He had great respect for the Dharma, and so he and five hundred women venerated that Dharma teacher with song and music.

source: །དགེ་སློང་དེ་ལ་རིན་པོ་ཆེའི་མེ་ཏོག་སྣ་ཚོགས་ཀྱིས་ཀྱང་མངོན་པར་གཏོར་ཏེ། ཙན་དན་གྱི་བྱུག་པས་ཀྱང་བྱུགས་སོ། །རས་བཅོས་བུ་ལྔ་བརྒྱས་ཀྱང་བཀབ་བོ། །བདེ་བའི་རིམ་གྲོ་ཐམས་ཅད་ཀྱིས་མཆོད་པ་འདི་ལྟ་སྟེ།
en: He scattered many types of precious flowers over that monk, anointed him with sandalwood ointment, and swathed him in five hundred brocades. Furthermore, the king venerated him with every type of delightful service.

source: ཆོས་སྨྲ་བ་ལ་མཆོད་པའི་མཆོད་པ་མཆོག་གིས་ཞག་བདུན་དུ་རིམ་གྲོ་བྱས་སོ།
en: In this way, he served that Dharma teacher with perfect offerings for seven days.

source: །དེ་ནས་དགེ་སློང་དེ་ལ་ཁྱིམ་བདག་གི་བུ་དེ་དག་གིས་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱིས་གླེངས་སོ།
en: “However, those sons of householders accused that monk of flawed discipline.

source: །ལས་དེའི་རྣམ་པར་སྨིན་པས་དེ་དག་ལོ་དགུ་ཁྲིར་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེས་སོ།
en: As that action ripened, they were born in the hells for ninety thousand years.

source: །ཚེ་རབས་ལྔ་བརྒྱ་ལྔ་བརྒྱར་ནི་མི་རྣམས་ཀྱི་ནང་དུ་ཟ་མ་དང་། ཀླ་ཀློ་དང་། ལོག་པར་ལྟ་བའི་ཁྱིམ་རྣམས་སུ་སྐྱེས་སོ།
en: Then, for five hundred consecutive lifetimes they were born in the human realm as ṣaṇḍhas, as barbarians, and into families with wrong views.

source: །ཚེ་རབས་དྲུག་བརྒྱར་ནི་དམུས་ལོང་དང་ལྕེ་མེད་པར་གྱུར་ཏོ།
en: After that, for six hundred lifetimes they were born blind and mute.

source: །ཚེ་རབས་བདུན་བརྒྱར་ནི་རབ་ཏུ་བྱུང་ནས་ཇི་སྲིད་འཚོའི་མཐར་ཐུག་གི་བར་དུ་གཟུངས་མ་ཐོབ་པར་འཆི་བའི་དུས་བྱས་ཏེ།
en: Then, for seven hundred lifetimes they went forth and remained ordained for the rest of their lives, but they died without having attained dhāraṇī.

source: ལས་ཀྱི་སྒྲིབ་པ་དེ་ཉིད་ཀྱིས་རིགས་ཀྱི་བུ་དེ་དག་བསྒྲིབས་སོ།
en: That is the karmic obscuration veiling these noble sons.

source: །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་ཁྱོད་མོས་པར་བྱའོ།
en: “Noble son, you should therefore trust this and understand it.

source: །ཁྱོད་ཀྱི་ཁོང་དུ་ཆུད་པར་བྱའོ། །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཆོས་སྨྲ་བ་ལ་མངོན་སུམ་དུ་མཐོང་ཡང་འཆལ་པའི་ཚུལ་ཁྲིམས་ཀྱིས་བརྗོད་པར་མི་བྱ་ན་ཐོས་པ་ལྟ་ཅི་སྨོས།
en: Having heard this Dharma discourse, you should never speak of a Dharma teacher having flawed discipline, even if you witness it in person, let alone hear word of it.

source: རིགས་ཀྱི་བུ་གང་ཞིག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མིག་འབྱིན་པར་བྱེད་པ་བས་ནི་གང་ཞིག་ཆོས་སྨྲ་བ་ལ་གཤེ་བའི་བསམ་པས་ལྟ་བར་བྱེད་ན། དེ་ནི་དེ་བས་ཆེས་ཁ་ན་མ་ཐོ་བའི་ལས་ཆེ་བ་ཡིན་ནོ།
en: “Noble son, if one person were to pluck out the eyes of all beings, and another were to take a disparaging view of a Dharma teacher, the latter would commit an act of even graver negativity than the former.

source: །གང་ཞིག་སེམས་ཅན་ཐམས་ཅད་འཆིང་བར་བྱེད་ལ། གང་ཞིག་ཆོས་སྨྲ་བ་མཐོང་ན་རྒྱབ་ཀྱིས་ཕྱོགས་ཏེ་འདུག་པར་བྱེད་ན། བསོད་ནམས་མ་ཡིན་པ་འདི་ལ་བསོད་ནམས་མ་ཡིན་པ་སྔ་མ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ།
en: If one person were to bind all beings in fetters, and another were to turn his back on meeting a Dharma teacher, the unmeritorious act committed by the former would be nowhere near even a hundredth part of the unmeritorious act committed by the latter.

source: སྟོང་གི་ཆ་དང་། འབུམ་གྱི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: It would be nowhere near even a thousandth, or a one hundred thousandth part. No number, fraction, quantity, analogy, or comparison would come close.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is that?

source: གང་ཆོས་སྨྲ་བ་ལ་སྐུར་པ་འདེབས་པ་དེས་ནི་སངས་རྒྱས་ལ་སྐུར་པ་བཏབ་པར་འགྱུར་བའི་ཕྱིར་རོ།
en: Because whoever denigrates a Dharma teacher denigrates the Buddha.

source: །སངས་རྒྱས་ལ་བསྙེན་བཀུར་བྱ་བར་འདོད་པས་ཆོས་སྨྲ་བ་ལ་བསྙེན་བཀུར་བྱའོ།
en: If you wish to honor the Buddha, you should honor a Dharma teacher.

source: །སངས་རྒྱས་ལ་མཆོད་པར་འདོད་པས་ཆོས་སྨྲ་བ་ལ་མཆོད་པར་བྱའོ།
en: If you wish to worship the Buddha, you should worship a Dharma teacher.

source: །སངས་རྒྱས་ལ་ཕྱག་འཚལ་བར་འདོད་པས་ཆོས་སྨྲ་བ་ལ་ཕྱག་བྱའོ།
en: If you wish to pay homage to the Buddha, you should pay homage to a Dharma teacher.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བའི་ཕྱིར་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བྱང་ཆུབ་སེམས་དཔའ་ལས་བྱུང་བའི་ཕྱིར་རོ།
en: It is because the state of omniscience arises from the bodhisattvas—and the blessed buddhas arise from the bodhisattvas.

source: །གང་ལས་བརྟེན་ཏེ་བྱང་ཆུབ་སེམས་དཔའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་པ་དེ་ལས་བརྟེན་ནས་དེ་ནི་ཉོན་མོངས་པ་རྣམས་ཀྱི་འདོད་པའི་ལོངས་སྤྱོད་ལ་གནས་པར་བརྗོད་པར་མི་བྱ།
en: Since that takes place on the basis of the bodhisattvas’ arousing of the mind of awakening, one should not say that bodhisattvas are afflicted beings who indulge in pleasures.

source: དེ་ནི་ནམ་དུ་ཡང་ཚངས་པར་སྤྱོད་པ་ལ་མི་གནས་པར་བརྗོད་པར་མི་བྱ།
en: One should not say that they ever fail to observe pure conduct.

source: དེ་ནི་གཟུགས་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་ཞུགས་ཀྱང་གཟུགས་མེད་པར་ཉེ་བར་འགྲོ་བར་བརྗོད་པར་མི་བྱའོ།
en: Although they are absorbed in the formless absorptions one should not say that they enter the formless states.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཉོན་མོངས་པའི་དབང་གིས་མི་སྐྱེ་སྟེ།
en: Because bodhisattvas do not take rebirth under the sway of afflictions;

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་སྨོན་ལམ་གྱི་དབང་གིས་སྐྱེ་བའི་ཕྱིར་རོ།
en: rather, bodhisattvas take rebirth through the power of aspirations.

source: །དེ་ནི་བྱིས་པའི་སྤྱོད་པ་ཐམས་ཅད་ལས་གྲོལ་བའོ།
en: They are beyond all childish behavior.

source: །གང་བྱང་ཆུབ་སེམས་དཔའི་ཉོན་མོངས་པ་རྣམས་སྟོན་པར་འདོད་པ་དེས་ནི་ནམ་མཁའི་ཁམས་ཀྱི་གཟུགས་བསྟན་པར་འདོད་དུ་ཟད་དོ།
en: If you wanted to point out the afflictions of a bodhisattva, it would be no different from wanting to point out the physical form of space.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: “Noble son, as an analogy, as the chief of all nāgas, the nāga king Anavatapta is counted as one of the nāgas.

source: ཀླུ་ཐམས་ཅད་ཀླུ་ཉིད་དུ་སྤྱིར་སོང་བ་ཡིན་པས་ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་ནི་ཀླུའི་བགྲང་བར་ཡང་འགྲོ་ལ་ཀླུའི་ཉེས་པ་གསུམ་གྱིས་ཀྱང་གོས་པར་མི་འགྱུར་རོ།
en: Nevertheless, he is not afflicted by the three troubles of nāgas.

source: །གསུམ་གང་ཞེ་ན།
en: What are the three ways in which he is not afflicted?

source: མགོ་ལ་བྱེ་ཚན་མི་འབབ་པ་དང་། སྐྱོ་བ་པོའི་ལུས་དང་ལྷན་ཅིག་ཏུ་ཀུན་དུ་མི་གནས་པ་དང་། དེ་ལ་ནམ་མཁའ་ལྡིང་གི་འཇིགས་པ་མི་འབྱུང་བ་སྟེ།
en: Hot sand does not fall on his head, he is never infested with vermin, and he is not subject to the terror of garuḍas.

source: རིགས་ཀྱི་བུ་ཀླུའི་སྐྱོན་གསུམ་པོ་དེ་དག་གིས་གོས་པར་མི་འགྱུར་རོ།
en: Noble son, these three troubles of the nāgas do not afflict Anavatapta.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྩེད་མོ་དང་། དགའ་བ་ཐམས་ཅད་ཉམས་སུ་མྱོང་བར་བྱེད་ཀྱང་སྲིད་པ་གསུམ་དུ་འདོད་པ་དང་། ཉོན་མོངས་པ་དང་། སྡུག་བསྔལ་རྣམས་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པར་བརྗོད་པར་བྱའོ།
en: Noble son, in the same way, even though bodhisattva great beings may engage in frolicking and all manner of joys, it must be said that they are not overcome by the desire, affliction, or suffering within the three existences.

source: །རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སེམས་ཅན་གྱི་རིས་ཉ་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ནི་ཆུ་ལ་སྤྱོད་ཆུ་ལ་བལྟ་ཡང་དེར་འཆི་བའི་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: “Noble son, as another analogy, there is a type of animal known as fisher that moves about in the water and looks into the water but does not die there.

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཁོར་བ་ན་སྤྱོད་ཀྱང་དེ་ཉིད་དུ་བྱིས་པའི་སྤྱོད་པ་ལ་གནས་ནས་ཡེ་ཤེས་ཀྱི་སྤྱོད་པ་ཚོལ་ལོ།
en: Noble son, likewise, bodhisattva great beings may move about in cyclic existence, but while engaging in the conduct of childish beings, they in fact pursue the conduct of wisdom.

source: །ཆོས་ཡང་དག་པར་བླངས་པས་ཀྱང་རྨོངས་པར་མི་འགྱུར་རོ།
en: Having taken up the Dharma, they do not become confused.

source: །བྱིས་པ་དང་ལྷན་ཅིག་ཏུ་གནས་པས་སྲིད་པ་གསུམ་གྱི་སྡུག་བསྔལ་ཉམས་སུ་མྱོང་བར་ཡང་མི་འགྱུར་རོ།
en: They live alongside childish beings, but they do not experience the sufferings of the three existences.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བདག་བསྲུང་བར་བྱའོ།
en: Therefore, bodhisattva great beings will protect themselves.”

source: །དེ་ནས་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: The Blessed One then spoke the following verses:

source: །བདེ་བར་གཤེགས་པ་གང་ཞིག་མཆོད་བྱ་དང་། །དེ་ལ་གང་ཞིག་ཕྱག་ཀྱང་འཚལ་འདོད་པ།
en: “If someone wishes to worship the Well-Gone One And pay homage to him,

source: །དེས་འདིར་བདེ་གཤེགས་སྲས་རྣམས་མཆོད་པར་བྱ།
en: They should worship the Well-Gone One’s offspring here.

source: །འདི་ནི་རྒྱལ་བ་རྣམས་ལ་མཆོད་པ་མཆོག །ང་ཡི་གོས་དང་ལྷུང་བཟེད་གདིང་བ་དང་། །མལ་ཆ་དང་ནི་འཆག་ས་གང་ཡིན་པ། །གང་དག་བྱང་ཆུབ་དོན་དུ་བརྩོན་བྱེད་པ།
en: This is the supreme act of worshiping the victors. “All my clothes, my alms bowl, sitting mat, Bedding, and walkway—

source: །དེ་དག་ལ་ནི་ང་ཡིས་གནང་བ་ཡིན།
en: I give all of them To those striving for awakening.

source: །འདི་ལྟར་མི་མཆོག་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་།
en: “All the buddhas, those supreme humans,

source: །དེ་ལས་ངེས་པར་ཤིན་ཏུ་བྱུང་བའི་ཕྱིར།
en: Have surely arisen from such beings.

source: །སངས་རྒྱས་རྣམས་ལ་ཇི་ལྟར་མཆོད་བྱ་བ།
en: So worship them in the very same way

source: །དེ་བཞིན་དེ་དག་ལ་ཡང་མཆོད་པར་བྱ།
en: As you would worship the buddhas.

source: །དེ་དང་དེ་དག་མགོན་དང་མཁས་པ་སྟེ།
en: “These are the guardians and adepts;

source: །ལོང་བ་རྣམས་ལ་མིག་ཀྱང་སྦྱིན་པར་བྱེད།
en: They give sight to those who are blind.

source: །ལམ་ལ་རྨོངས་པ་རྣམས་ཀྱི་སྟོན་པ་སྟེ།
en: They show the path to those who are lost

source: །འཆི་བ་མེད་པའི་ཕྱོགས་སུ་འདྲེན་པ་ཡིན།
en: And guide them to the deathless state.

source: །གལ་ཏེ་སེམས་ཅན་རྣམས་ཀྱིས་དེ་དག་ལ།
en: “Even if beings were to joyfully give them

source: །རྟག་ཏུ་དགའ་བས་ལོངས་སྤྱོད་ཀུན་བྱིན་ཡང་། །དེ་དག་རྣམས་ཀྱི་དང་པོའི་སེམས་བརྟེན་པ།
en: All types of wealth in a constant stream,

source: །དེ་ལའང་ལན་གླན་བྱས་པར་མི་འགྱུར་རོ།
en: That would not be enough to match Their beginning to rely on the mind of awakening.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བག་ཚ་བ་མེད་པར་གནས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: The bodhisattva great being Undaunted then addressed the Blessed One:

source: །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་ལས་ཀྱི་སྒྲིབ་པ་དེ་གང་གིས་རྣམ་པར་དག་པར་འགྱུར་བའི་རྣམ་གྲངས་འགའ་ཞིག་མཆིས་ལགས་སམ།
en: “Blessed One, is there an instruction through which these bodhisattvas can purify their karmic obscuration?”
